# language: ru
Feature: Авторизация пользователя

Сценарий: Успешная авторизация на сайте https://sberdevices.ru
Когда пользователь вводит правильный логин и пароль
И пользователь нажимает на кнопку "Войти"
Тогда система перенаправляет пользователя на главную страницу сайта https://sberdevices.ru
И пользователь видит, что он авторизован

Сценарий: Ошибка при авторизации
Когда пользователь вводит неправильный логин или пароль
И пользователь нажимает на кнопку "Войти"
Тогда система не авторизует пользователя и выводит сообщение об ошибке

Сценарий: Сброс пароля
Когда пользователь нажимает на "Не могу войти"
И нажимает на "Не помню логин или пароль"
И нажимает на кнопку "Восстановить доступ"
И пользователь вводит номер телефона, связанный с его аккаунтом
И пользователь нажимает на кнопку "Продолжить"
Тогда система отправляет на указанный номер код
