# language: ru
Feature: Работа с корзиной покупок

Сценарий: Добавление товара в корзину
Когда пользователь нажимает кнопку "В магазин"
И пользователь нажимает на кнопку "Купить" любого товара
Тогда система добавляет товар в корзину

Сценарий: Изменение количества товаров в корзине
Когда пользователь открывает корзину покупок
И пользователь изменяет количество товара
Тогда система обновляет количество товаров в корзине

Сценарий: Удаление товара из корзины
Когда пользователь открывает корзину покупок
И пользователь удаляет товар из корзины
Тогда система удаляет товар из корзины

Сценарий: Сохранение товаров в корзине
Когда пользователь добавляет товары в корзину
И пользователь закрывает страницу сайта https://sberdevices.ru
И пользователь снова открывает страницу сайта https://sberdevices.ru
Тогда система сохраняет добавленные товары в корзине